// задача 2.
// Напишите программу, которая на вход принимает два числа и выдвет, какое число больше, а какое меньшее.
// a = 5, b = 7  - max = 7
// a = 2, b = 10  - max = 10
// a = -9, b = -3  - max = -3


int max = 0;
int a = -9;
int b = -3;

if( a > b )
{
    max = a;
}
else 
{
    max = b;

}
Console.WriteLine (max);
